zhelezyaka/lev-gen2-stm8s005k6/ lev-gen2-stm8s005k6/src/LevG2_mainfun.c
unsigned int Calibration_Func(){

    setMosFET(CHG_MOSFET, TurnOff);
    setMosFET(DSG_MOSFET, TurnOff);
    InitADCFunction();
    Set_Interrupt_ADC_Conversion_Finish_Function(GetAllADCValuesAndSetDirection); //wait for startAdcConversion()

    //SetLed_DirectIO_BITs  
    while(1){
      
        for(int i = 0; i < 100;i++){
            delay_cycles(100); //about 960us at 4MHz
        }//96 ms
      
        startAdcConversion();
    };
    setMosFET(CHG_MOSFET, TurnOff);
    setMosFET(DSG_MOSFET, TurnOff);
  return StartUp;
}

#if 0
unsigned int Normal_Func(){
  //////////////////////////////////////////////////////////////////////////////
  // 2012/05/07 Remove DOC Propection, hsinmo
  //unsigned int DSG_OC_Delay_Count;
  unsigned int CHG_OC_Delay_Count;
  unsigned int _2ND_OV_Delay_Count;
  unsigned int _2ND_UV_Delay_Count;
  unsigned int iTemp1, iTemp2;
  
  //DSG_OC_Delay_Count = 0;
  CHG_OC_Delay_Count = 0;
  _2ND_OV_Delay_Count = 0;
  _2ND_UV_Delay_Count = 0;
  
  setMosFET(MOSFET_CHG, DeviceOn);
  setMosFET(MOSFET_DSG, DeviceOn);


  //Clear Activate Action Flag
  G_Activate_Action_Status = 0;
  G_Activate_Action_Status_Other1  = 0;
  //G_CHG_CV_MODE_Cycle_Count = 0;
  //G_DSG_CHG_OC_Delay_Count = 0;
  
  //Coulomb Counter Start
  G_Activate_Action_Status |= ACCUMULATING_Q_ENABLE;
  
  while(1){

    
    __delay_cycles(3000);  // 3ms ==> 1MHz clock
    StartAdcConversion();
    
    ///////////////////////////////////////
    // Current Detection
    iTemp1 = GetADCValue(ICHG_ADC);
    iTemp2 = GetADCValue(IDSG_ADC);
    if( iTemp1 >= ADC_DETECT_CURRENT_OF_CHG_STATUS){
      // in charging status
      G_Module_Status &= ~Module_DSG;
      G_Module_Status &= ~Module_RELAX;
    }else if( iTemp2 < ADC_DETECT_CURRENT_OF_DSG_STATUS ){
      // in relaxation mode or Quiescent current
      G_Module_Status |= Module_DSG;
      G_Module_Status |= Module_RELAX;
    }else{
      // in discharging
      G_Module_Status &= ~Module_RELAX;
      G_Module_Status |= Module_DSG;
    }
  
    
    if( iTemp1 >= ADC_COC_PROTECTION && ((G_Module_Status & Module_C_OC) == 0 )){
      CHG_OC_Delay_Count++;
      if(CHG_OC_Delay_Count >= OC_PROTECTION_DELAY_LOOP_COUNT){
        G_Module_Status |= Module_C_OC;
        //setBlinkLED(OC_BlinkLED, true);
      }
    }else{
      CHG_OC_Delay_Count = 0;
    }
//////////////////////////////////////////////////////////////////////////////
// 2012/05/07 Remove DOC Propection, hsinmo
//    if( iTemp2 >= ADC_DOC_PROTECTION && ((G_Module_Status & Module_D_OC) == 0 )){
//      G_DSG_CHG_OC_Delay_Count += (1 << 4);
//      if((G_DSG_CHG_OC_Delay_Count & 0xf0) >= (PROTECTION_DELAY_LOOP_COUNT << 4 )){
//        G_Module_Status |= Module_D_OC;
//        setBlinkLED(OC_BlinkLED, true);
//      }
//    }else{
//      G_DSG_CHG_OC_Delay_Count &= ~(0xf0);
//    }
    
    
    
    ///////////////////////////////////////
    //  Voltage control
    //Vbat Voltage check ==> 2nd level
    iTemp1 = GetADCValue(Vbat_ADC);
   
    if( iTemp1 > ADC_2ND_BATTERY_OV_PROTECTION &&
        (G_Module_Status & Module_2nd_OV) == 0)
    {
      _2ND_OV_Delay_Count++;
      if(_2ND_OV_Delay_Count >= OV_PROTECTION_DELAY_LOOP_COUNT){
        G_Module_Status |= Module_2nd_OV;
        //setBlinkLED(OV_UV_BlinkLED, true);
      }
    }else if( iTemp1 < ADC_2ND_BATTERY_UV_PROTECTION && 
        (G_Module_Status & Module_2nd_UV) == 0)
    {
      _2ND_UV_Delay_Count++;
      if(_2ND_UV_Delay_Count >= UV_PROTECTION_DELAY_LOOP_COUNT){
        G_Module_Status |= Module_2nd_UV;
        //setBlinkLED(OV_UV_BlinkLED, true);
      }
    }else{
      _2ND_UV_Delay_Count = 0;
      _2ND_OV_Delay_Count = 0;
    }
    
    //Cell OV/UV protection and release
    if(get_PIC_UVP_Status()){
      G_Module_Status |= Module_UV;
    }else{
      G_Module_Status &= ~Module_UV;
    }
    if(get_PIC_OVP_Status()){
      G_Module_Status |= Module_OV;
    }else{
      G_Module_Status &= ~Module_OV;
    }   
    

    ///////////////////////////////////////
    //Thermal protection
    iTemp1 = GetADCValue(T1_ADC);
    if( iTemp1 <= ADC_CHG_OT_PROTECTION){
      G_Module_Status |= Module_CHG_OT;
    }
    if( iTemp1 <= ADC_DSG_OT_PROTECTION){
      G_Module_Status |= Module_DSG_OT;
    }
    
    if( iTemp1 >= ADC_UT_PROTECTION){
      G_Module_Status |= Module_UT;
    }
    if(G_Module_Status & Module_DSG_OT ||
       G_Module_Status & Module_CHG_OT ||
       G_Module_Status & Module_UT  ||
       G_Module_Status & Module_OV  ||
       G_Module_Status & Module_UV){
      //setBlinkLED(OT_UT_BlinkLED, true);
//      setBlinkLED(OV_UV_BlinkLED, true);
    }else{
      //setBlinkLED(OT_UT_BlinkLED, false);
//      setBlinkLED(OV_UV_BlinkLED, false);
    }
    
    /////////////////////////////////////////////////////////
    // Check abnormal Flag
    /////////////////////////////////////////////////////////
//    if((G_Module_Status & Module_2nd_OV) && (G_Module_Status & Module_2nd_UV)) {
//      G_uc_SystemFailureCode = _2nd_Level_Vol_Fail;
//      return FailureMode;
//    }
    /////////////////////////////////////////////////////////
    //2012/05/21 remove Fail mode function, hsinmo
//    if((G_Module_Status & Module_RELAX) && ((G_Module_Status & Module_DSG)==0)){
//      G_uc_SystemFailureCode = AbnormalFlagFail;
//      return FailureMode;
//    }
//    if((G_Module_Status & Module_C_OC) && (G_Module_Status & Module_D_OC)){
//      G_uc_SystemFailureCode = AbnormalFlagFail;
//      return FailureMode;
//    }
//    if((G_Module_Status & Module_UV) && (G_Module_Status & Module_OV)){
//      G_uc_SystemFailureCode = AbnormalFlagFail;
//      return FailureMode;
//    }
//    if((G_Module_Status & Module_DSG_OT) && (G_Module_Status & Module_UT)){
//      G_uc_SystemFailureCode = ThermalFail;
//      return FailureMode;
//    }
//    if((G_Module_Status & Module_CHG_OT) && (G_Module_Status & Module_UT)){
//      G_uc_SystemFailureCode = ThermalFail;
//      return FailureMode;
//    }
    
